{
    "title": "IBM Cloud overview docs",
    "lastupdated": "2021-09-28",
    "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
    "section_devtools": {
      "api": "/docs?tab=api-docs&category=platform_services",
      "cli": "/docs?tab=develop",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
    },
    "section_recommended": [
      {
        "title": "What's included in the platform?",
        "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
        "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
      },
      {
        "title": "Try out IBM Cloud, for free",
        "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
        "href": "/docs/overview?topic=overview-tutorial-try-for-free"
      },
      {
        "title": "Service and infrastructure by location",
        "description": "Check out the regions and data centers that IBM Cloud products are available.",
        "href": "/docs/overview?topic=overview-services_region"
      }
    ],
    "section_videos": [
      {
        "title": "Learn how to navigate through the IBM Cloud console",
        "href": "/docs/overview?topic=overview-ui#video-ui",
        "thumbnail": "/images/welcome-thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {
          "date": "27 September 2021",
          "title": "Securing your resources with context-based restrictions",
          "description": "You can now use context-based restrictions to configure and enforce access restrictions for IBM Cloud resources. The access restrictions are based on the network location where an access request is created. These restrictions work in tandem with traditional IAM access policies, which are based on identity, to provide an extra layer of protection. Since both IAM access and context-based restrictions must enforce access, context-based restrictions offer protection even in the face of compromised or mismanaged credentials."
        },
        {
          "date": "24 September 2021",
          "title": "Assigning access policies based on resource location",
          "description": "For supporting services, like Container Registry, you can now scope access to more granular locations in your access group policies, such as geography, country, metro, or a specific Satellite location."
        },
        {
          "date": "20 September 2021",
          "title": "Checking the root cause of an incident",
          "description": "You can now visit the Incident reports page to review technical details of major outages for IBM Cloud services. You can find Customer Incident Reports (CIR) on the page, which provide Root Cause Analysis (RCA) for past major outages. You are able to view and download the incident reports from the page about any events that affect IBM Cloud availability. These reports are in PDF file formats and available for 5 years starting from the date when the event occurred."
        }
      ]
    }
  }
