{
  "title": "IBM Cloud overview docs",
  "lastupdated": "2022-10-10",
  "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
  "section_devtools": {
    "api": "/docs?tab=api-docs&category=platform_services",
    "cli": "/docs?tab=develop",
    "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
  },
  "section_recommended": [
    {
      "title": "What's included in the platform?",
      "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
      "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
    },
    {
      "title": "Try out IBM Cloud, for free",
      "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
      "href": "/docs/overview?topic=overview-tutorial-try-for-free"
    },
    {
      "title": "Service and infrastructure by location",
      "description": "Check out the regions and data centers that IBM Cloud products are available.",
      "href": "/docs/overview?topic=overview-services_region"
    }
  ],
  "section_videos": [
    {
      "title": "Learn how to navigate through the IBM Cloud console",
      "href": "/docs/overview?topic=overview-ui#video-ui",
      "thumbnail": "/images/welcome-thumbnail.png"
    }
  ],
  "section_learn": {
    "developer": "https://developer.ibm.com/depmodels/cloud/",
    "architecture": "https://www.ibm.com/cloud/architecture",
    "training": "https://www.ibm.com/training/cloud",
    "community": "https://community.ibm.com/community/user/publiccloud/home"
  },
  "section_updates": {
    "view_more": "/docs/overview?topic=overview-whatsnew",
    "tiles": [
      {
        "date": "10 October 2022",
        "title": "A new way to provide the IBM Cloud docs team your feedback",
        "description": "We want to hear from you! Let us know about your experience with the IBM Cloud docs or API docs by submitting your feedback from the Feedback button. You can tell us what you love and even what you’d like to see improved, so we can work together to ensure that you always enjoy the IBM Cloud documentation."
      },
      {
        "date": "07 October 2022",
        "title": "Setting an alternative account owner",
        "description": "As the owner of an account with classic infrastructure, you can set a trusted profile as the alternative account owner. An alternative account owner ensures that you always have a secure way to manage account ownership if your account owner leaves your organization or isn't available."
      },
      {
        "date": "04 October 2022",
        "title": "Catalog integration with Virtual Private Cloud custom images",
        "description": "ISV Partners and IBM Cloud customers can now import custom VPC images directly to their account or enterprise, or sell on the IBM Cloud catalog without depending on Terraform."
      },
      {
        "date": "29 September 2022",
        "title": "Enabling Event Notifications for the notification distribution list",
        "description": "You can now easily add IBM Cloud Event Notifications instances to the notification distribution list and receive account-wide IBM Cloud notifications. With Event Notifications, you can choose to deliver your notifications to different destinations, including email, SMS, or webhooks. When an event of interest occurs on the IBM Cloud platform and an event is generated, the notification distribution list communicates with a connected Event Notifications instance to forward a notification to the supported destination."
      }
    ]
  }
}
