{
  "title": "IBM Cloud overview docs",
  "lastupdated": "2023-04-10",
  "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
  "section_devtools": {
    "api": "/docs?tab=api-docs&category=platform_services",
    "cli": "/docs?tab=develop",
    "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
  },
  "section_recommended": [
    {
      "title": "What's included in the platform?",
      "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
      "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
    },
    {
      "title": "Try out IBM Cloud, for free",
      "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
      "href": "/docs/overview?topic=overview-tutorial-try-for-free"
    },
    {
      "title": "Service and infrastructure by location",
      "description": "Check out the regions and data centers that IBM Cloud products are available.",
      "href": "/docs/overview?topic=overview-services_region"
    }
  ],
  "section_videos": [
    {
      "title": "Learn how to navigate through the IBM Cloud console",
      "href": "/docs/overview?topic=overview-ui#video-ui",
      "thumbnail": "/images/welcome-thumbnail.png"
    }
  ],
  "section_learn": {
    "developer": "https://developer.ibm.com/depmodels/cloud/",
    "architecture": "https://www.ibm.com/cloud/architecture",
    "training": "https://www.ibm.com/training/cloud",
    "community": "https://community.ibm.com/community/user/publiccloud/home"
  },
  "section_updates": {
    "view_more": "/docs/overview?topic=overview-whatsnew",
    "tiles": [
      {
        "date": "10 April 2023",
        "title": "Check out the new deployable architectures in the catalog",
        "description": "IBM Cloud provides deployable architectures in the IBM Cloud Catalog, which are products that provide automation for the deployment of common architectural patterns that combine one or more cloud resources and are designed for scalability and modularity. Go to the catalog, and filter by Deployable architectures to review the growing catalog of options."
      },
      {
        "date": "10 April 2023",
        "title": "IBM Cloud projects for automated IaC deployments",
        "description": "You can now configure, deploy, and monitor deployments by using DevOps best practices with projects. By using projects, you can manage Infrastructure as Code (IaC) at scale and across accounts to ensure that the configuration is always valid, secure, and compliant."
      },
      {
        "date": "10 April 2023",
        "title": "Onboard customized deployable architectures for your enterprise users",
        "description": "You can customize IBM Cloud provided deployable architectures to meet your enterprise’s needs, and then leverage private catalogs to make only approved and compliant architectures available for your enterprise developers to deploy."
      }
    ]
  }
}
