{
    "title": "IBM Cloud overview docs",
    "lastupdated": "2021-10-25",
    "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
    "section_devtools": {
      "api": "/docs?tab=api-docs&category=platform_services",
      "cli": "/docs?tab=develop",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
    },
    "section_recommended": [
      {
        "title": "What's included in the platform?",
        "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
        "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
      },
      {
        "title": "Try out IBM Cloud, for free",
        "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
        "href": "/docs/overview?topic=overview-tutorial-try-for-free"
      },
      {
        "title": "Service and infrastructure by location",
        "description": "Check out the regions and data centers that IBM Cloud products are available.",
        "href": "/docs/overview?topic=overview-services_region"
      }
    ],
    "section_videos": [
      {
        "title": "Learn how to navigate through the IBM Cloud console",
        "href": "/docs/overview?topic=overview-ui#video-ui",
        "thumbnail": "/images/welcome-thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {
          "date": "25 October 2021",
          "title": "Securing IBM Cloud accounts",
          "description": "Our focus is to provide the most secure public cloud. That's why we will be verifying user identities and securing accounts through credit card verification when creating new accounts starting 25 October 2021. Don't worry, we won't charge you for signing up, and you can still try IBM Cloud for free."
        },
        {
          "date": "05 October 2021",
          "title": "Suspending and deprecating third-party software",
          "description": "As a third-party provider, you can now suspend and deprecate published software from the IBM Cloud catalog to meet the needs of your product's lifecycle. When you suspend a product or version, it is immediately removed from the catalog. When you deprecate a product or version, it remains available for use in the catalog for 90 days. After 90 days, it's permanently removed."
        },
        {
          "date": "05 October 2021",
          "title": "Suspending and deprecating private products",
          "description": "As a private catalog owner, you can now suspend or deprecate software that's in your private catalogs. When you suspend a version of software, it's immediately removed from your private catalog. When you deprecate software, it remains available to users with access to the private catalog for 90 days. After 90 days, it's permanently removed."
        },
        {
          "date": "05 October 2021",
          "title": "Filtering the IBM Cloud catalog by specific providers",
          "description": "The latest updates and improvements to IBM Cloud catalog include support for filtering products by provider name. If you're looking for a specific provider's products or curious about how many products that a provider offers, you can use the Provider filter to narrow down your search."
        },
        {
          "date": "27 September 2021",
          "title": "Securing your resources with context-based restrictions",
          "description": "You can now use context-based restrictions to configure and enforce access restrictions for IBM Cloud resources. The access restrictions are based on the network location where an access request is created. These restrictions work in tandem with traditional IAM access policies, which are based on identity, to provide an extra layer of protection."
        }
      ]
    }
  }
  
