{
    "title": "IBM Cloud overview docs",
    "lastupdated": "2022-07-11",
    "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
    "section_devtools": {
      "api": "/docs?tab=api-docs&category=platform_services",
      "cli": "/docs?tab=develop",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
    },
    "section_recommended": [
      {
        "title": "What's included in the platform?",
        "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
        "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
      },
      {
        "title": "Try out IBM Cloud, for free",
        "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
        "href": "/docs/overview?topic=overview-tutorial-try-for-free"
      },
      {
        "title": "Service and infrastructure by location",
        "description": "Check out the regions and data centers that IBM Cloud products are available.",
        "href": "/docs/overview?topic=overview-services_region"
      }
    ],
    "section_videos": [
      {
        "title": "Learn how to navigate through the IBM Cloud console",
        "href": "/docs/overview?topic=overview-ui#video-ui",
        "thumbnail": "/images/welcome-thumbnail.png"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/overview?topic=overview-whatsnew",
      "tiles": [
        {  
          "date": "08 July 2022",
          "title": "Updating published support information in Partner Center",
          "description": "You can now update support information that is already published to IBM Cloud. You can make any changes by editing your published information and requesting an approval for them. After your changes are approved, you can publish them."
        },
        {
          "date": "23 June 2022",
          "title": "Onboarding software to sell on IBM Cloud by using the API",
          "description": "To sell your product on IBM Cloud, you can now onboard it by using the Partner Center Sell API, in addition to using the Partner Center experience in the console."
        },
        {
          "date": "04 May 2022",
          "title": "Required access to view service credentials",
          "description": "When the credential level access can't be determined by comparing the access of the user and the credential, the credential will be redacted. Services that support access control on resources that are allocated in the context of a service instance, such as Cloud Object Storage buckets, now require the user to have the resource-controller.credential.retrieve_all action to view service credentials."
        }
      ]
    }
  }
  
