{
  "title": "IBM Cloud overview docs",
  "lastupdated": "2022-09-27",
  "introduction": "The platform is built to support your needs whether it's working only in the public cloud or taking advantage of a multicloud deployment model. Leverage the docs, API & SDK reference, architecture references, and more to support your app development needs.",
  "section_devtools": {
    "api": "/docs?tab=api-docs&category=platform_services",
    "cli": "/docs?tab=develop",
    "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs"
  },
  "section_recommended": [
    {
      "title": "What's included in the platform?",
      "description": "The platform consists of a network of interrelated components that work together to provide a consistent and dependable cloud experience to support your app development needs.",
      "href": "/docs/overview?topic=overview-whatis-platform#built-into-platform"
    },
    {
      "title": "Try out IBM Cloud, for free",
      "description": "Get up and running quickly by setting up an account and exploring free products with this short tutorial.",
      "href": "/docs/overview?topic=overview-tutorial-try-for-free"
    },
    {
      "title": "Service and infrastructure by location",
      "description": "Check out the regions and data centers that IBM Cloud products are available.",
      "href": "/docs/overview?topic=overview-services_region"
    }
  ],
  "section_videos": [
    {
      "title": "Learn how to navigate through the IBM Cloud console",
      "href": "/docs/overview?topic=overview-ui#video-ui",
      "thumbnail": "/images/welcome-thumbnail.png"
    }
  ],
  "section_learn": {
    "developer": "https://developer.ibm.com/depmodels/cloud/",
    "architecture": "https://www.ibm.com/cloud/architecture",
    "training": "https://www.ibm.com/training/cloud",
    "community": "https://community.ibm.com/community/user/publiccloud/home"
  },
  "section_updates": {
    "view_more": "/docs/overview?topic=overview-whatsnew",
    "tiles": [
      {
        "date": "26 September 2022",
        "title": "Identifying inactive policies",
        "description": "To reduce the number of policies in your account and keep only the minimum access that is necessary for each user, you can now identify the infrequently used access policies on the Inactive policies page in the console. You can determine whether to remove the inactive policies, or in some cases, you might expect an infrequently used policy."
      },
      {
        "date": "26 September 2022",
        "title": "Exporting user access reports",
        "description": "Make sure that users have only the access that they need. Export an access policy report for any user in your account to view all of the access policies that they are assigned."
      },
      {
        "date": "22 September 2022",
        "title": "A new way to provide IBM Cloud your feedback",
        "description": "We want to hear from you! Let us know about your experience with the IBM Cloud console by submitting your feedback from the Help > Send feedback option in the console menu bar. You can tell us what you love and even what you’d like to see improved, so we can work together to ensure that you always enjoy developing on IBM Cloud."
      }
    ]
  }
}
